In [1]:
import pandas as pd

In [3]:
print(pd.__version__)

1.4.2

In [15]:
a=[1,2,4,5,7]
s1=pd.Series(a)
print(s1)

0    1
1    2
2    4
3    5
4    7
dtype: int64

In [9]:
a=[1,2,4,5,7]
s1=pd.Series(a,index=["i1","i2","i3","i4","i5"])
print(s1)

i1    1
i2    2
i3    4
i4    5
i5    7
dtype: int64

In [10]:
print(s1["i3"])

4

In [12]:
keyVal={"AIML":4,"CCN":4,"WS":3,"CS":4}
sKeyVal=pd.Series(keyVal)
print(sKeyVal)

AIML    4
CCN     4
WS      3
CS      4
dtype: int64

In [20]:
student={"subject":["aiml","ccn","ws","cs"],
        "marks":[90,82,75,99]}
dfStud=pd.DataFrame(student)
dfStud

  subject  marks
0    aiml     90
1     ccn     82
2      ws     75
3      cs     99

In [23]:
print(dfStud.loc[0]) #loc=locatin,to featch single row

subject    aiml
marks        90
Name: 0, dtype: object

In [65]:
student=pd.read_csv('b_v/data.csv') #to get infromation from csv file
student

   Sr No.     Name       BOD Course Percentage  Percent
0       1   Krishi  20/12/02  MscIt     63.00%       61
1       2   Vaishu  07/01/01  MscIt     58.00%       71
2       3     Arti  06/02/02  MscIt     52.00%       81
3       4    Vidhi  04/03/01  MscIt     68.00%       69
4       5   Trusha  17/01/01  MscIt     78.00%       85
5       6  Rishika  26/11/00    NaN     88.00%       58

In [66]:
print(student.head()) # (head) first 5 row data

   Sr No.    Name       BOD Course Percentage  Percent
0       1  Krishi  20/12/02  MscIt     63.00%       61
1       2  Vaishu  07/01/01  MscIt     58.00%       71
2       3    Arti  06/02/02  MscIt     52.00%       81
3       4   Vidhi  04/03/01  MscIt     68.00%       69
4       5  Trusha  17/01/01  MscIt     78.00%       85

In [67]:
print(student.tail()) #(tail) last 5 row data

   Sr No.     Name       BOD Course Percentage  Percent
1       2   Vaishu  07/01/01  MscIt     58.00%       71
2       3     Arti  06/02/02  MscIt     52.00%       81
3       4    Vidhi  04/03/01  MscIt     68.00%       69
4       5   Trusha  17/01/01  MscIt     78.00%       85
5       6  Rishika  26/11/00    NaN     88.00%       58

In [68]:
print(student.info()) # show all the information such as datatype,null and not null.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Sr No.      6 non-null      int64
 1   Name        6 non-null      object
 2   BOD         6 non-null      object
 3   Course      5 non-null      object
 4   Percentage  6 non-null      object
 5   Percent     6 non-null      int64
dtypes: int64(2), object(4)
memory usage: 416.0+ bytes
None

In [69]:
newstudent=student.dropna() # drop rows with null value
print(newstudent)

   Sr No.    Name       BOD Course Percentage  Percent
0       1  Krishi  20/12/02  MscIt     63.00%       61
1       2  Vaishu  07/01/01  MscIt     58.00%       71
2       3    Arti  06/02/02  MscIt     52.00%       81
3       4   Vidhi  04/03/01  MscIt     68.00%       69
4       5  Trusha  17/01/01  MscIt     78.00%       85

In [70]:
filledStud=student.fillna(30) # fill the value of null
print(filledStud)

   Sr No.     Name       BOD Course Percentage  Percent
0       1   Krishi  20/12/02  MscIt     63.00%       61
1       2   Vaishu  07/01/01  MscIt     58.00%       71
2       3     Arti  06/02/02  MscIt     52.00%       81
3       4    Vidhi  04/03/01  MscIt     68.00%       69
4       5   Trusha  17/01/01  MscIt     78.00%       85
5       6  Rishika  26/11/00     30     88.00%       58

In [71]:
new=student["Course"].fillna("MCA") 
new
#it will fill the place where course is empty

0    MscIt
1    MscIt
2    MscIt
3    MscIt
4    MscIt
5      MCA
Name: Course, dtype: object

In [72]:
student["Course"].fillna("MCA",inplace=True) 
student
# to store data in specified row of table

   Sr No.     Name       BOD Course Percentage  Percent
0       1   Krishi  20/12/02  MscIt     63.00%       61
1       2   Vaishu  07/01/01  MscIt     58.00%       71
2       3     Arti  06/02/02  MscIt     52.00%       81
3       4    Vidhi  04/03/01  MscIt     68.00%       69
4       5   Trusha  17/01/01  MscIt     78.00%       85
5       6  Rishika  26/11/00    MCA     88.00%       58

In [80]:
student["Percentage"].fillna(55,inplace=True) 
student

   Sr No.     Name       BOD Course Percentage  Percent
0       1   Krishi  20/12/02  MscIt     63.00%       61
1       2   Vaishu  07/01/01  MscIt     58.00%       71
2       3     Arti  06/02/02  MscIt     52.00%       81
3       4    Vidhi  04/03/01  MscIt     68.00%       69
4       5   Trusha  17/01/01  MscIt     78.00%       85
5       6  Rishika  26/11/00    MCA     88.00%       58

In [78]:
mean=student["Percent"].mean()
print(f"mean:{mean}")

mean:70.83333333333333

In [75]:
mode=student["Percent"].mode()
print("mode:",mode[0])

mode: 58

In [76]:
median=student["Percent"].median()
print("median:",median)

median: 70.0